In [3]:
import pandas as pd

series1 = pd.Series([4.5, 7.2, -5.3, 3.6],index=['d','b','a','c'])
series1

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [5]:
# Series的實體方法reindex()
series1.reindex(['a','b','c','d'])

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [7]:
series1.reindex(['a','b','c'])

a   -5.3
b    7.2
c    3.6
dtype: float64

In [12]:
import numpy as np

frame = pd.DataFrame(
                    data=np.arange(9).reshape((3,3)),
                    index = ['a','c','d'],
                    columns = ['台北','台中','高雄']
                    )
frame

   台北  台中  高雄
a   0   1   2
c   3   4   5
d   6   7   8

In [16]:
frame.reindex(columns=['台北','台中'],index=['a','c'])

   台北  台中
a   0   1
c   3   4

In [ ]:
# 實體方法drop()
frame1 = pd.DataFrame(np.arange(16).reshape(4,4),
                   index=['台北','台中', '台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
frame1

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [20]:
frame1.drop(index=['台北','台中'],columns=['one','two'])

    three  four
台南     10    11
高雄     14    15